resource: https://research.splunk.com/endpoint/ff61e98c-0337-4593-a78f-72a676c56f26/

Suspicious DLLHost no Command Line Arguments 
Description:
The following analytic identifies DLLHost.exe with no command line arguments. It is unusual for DLLHost.exe to execute with no command line arguments present. This particular behavior is common with malicious software, including Cobalt Strike. During investigation, identify any network connections and parallel processes. Identify any suspicious module loads related to credential dumping or file writes. DLLHost.exe is natively found in C:\Windows\system32 and C:\Windows\syswow64.


    Type: TTP
    Product: Splunk Enterprise, Splunk Enterprise Security, Splunk Cloud
    Datamodel: Endpoint
    Last Updated: 2023-06-13
    Author: Michael Haag, Splunk
    ID: ff61e98c-0337-4593-a78f-72a676c56f26

ATT&CK
ID 	Technique 	Tactic
T1055 	Process Injection 	Defense Evasion, Privilege Escalation

spl:
============================================================================================
| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes where `process_dllhost` by _time span=1h  Processes.process_id Processes.process_name Processes.dest Processes.process_path Processes.process Processes.parent_process_name 
| `drop_dm_object_name(Processes)` 
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` 
| regex process="(?i)(dllhost\.exe.{0,4}$)" 
| `suspicious_dllhost_no_command_line_arguments_filter`
============================================================================================

How To Implement:
To successfully implement this search you need to be ingesting information on process that include the name of the process responsible for the changes from your endpoints into the Endpoint datamodel in the Processes node. In addition, confirm the latest CIM App 4.20 or higher is installed and the latest TA for the endpoint product.

Known False Positives:
Limited false positives may be present in small environments. Tuning may be required based on parent process.
